OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f85j94.h
extern __at(0x0E3B) volatile __RPINR34_35bits_t RPINR34_35bits;

#define _CCP6R0                 0x01
#define _CCP6R1                 0x02
#define _CCP6R2                 0x04
#define _CCP6R3                 0x08
#define _CCP7R0                 0x10
#define _CCP7R1                 0x20
#define _CCP7R2                 0x40
#define _CCP7R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR36_37 Bits

extern __at(0x0E3C) __sfr RPINR36_37;

typedef union
  {
  struct
    {
    unsigned CCP8R0             : 1;
    unsigned CCP8R1             : 1;
    unsigned CCP8R2             : 1;
    unsigned CCP8R3             : 1;
    unsigned CCP9R0             : 1;
    unsigned CCP9R1             : 1;
    unsigned CCP9R2             : 1;
    unsigned CCP9R3             : 1;
    };

  struct
    {
    unsigned CCP8R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned CCP9R              : 4;
    };
  } __RPINR36_37bits_t;

extern __at(0x0E3C) volatile __RPINR36_37bits_t RPINR36_37bits;

#define _CCP8R0                 0x01
#define _CCP8R1                 0x02
#define _CCP8R2                 0x04
#define _CCP8R3                 0x08
#define _CCP9R0                 0x10
#define _CCP9R1                 0x20
#define _CCP9R2                 0x40
#define _CCP9R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR38_39 Bits

extern __at(0x0E3D) __sfr RPINR38_39;

typedef union
  {
  struct
    {
    unsigned CCP10R0            : 1;
    unsigned CCP10R1            : 1;
    unsigned CCP10R2            : 1;
    unsigned CCP10R3            : 1;
    unsigned T0CKIR0            : 1;
    unsigned T0CKIR1            : 1;
    unsigned T0CKIR2            : 1;
    unsigned T0CKIR3            : 1;
    };

  struct
    {
    unsigned CCP10R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T0CKIR             : 4;
    };
  } __RPINR38_39bits_t;

extern __at(0x0E3D) volatile __RPINR38_39bits_t RPINR38_39bits;

#define _CCP10R0                0x01
#define _CCP10R1                0x02
#define _CCP10R2                0x04
#define _CCP10R3                0x08
#define _T0CKIR0                0x10
#define _T0CKIR1                0x20
#define _T0CKIR2                0x40
#define _T0CKIR3                0x80

//==============================================================================


//==============================================================================
//        RPINR40_41 Bits

extern __at(0x0E3E) __sfr RPINR40_41;

typedef union
  {
  struct
    {
    unsigned T1GR0              : 1;
    unsigned T1GR1              : 1;
    unsigned T1GR2              : 1;
    unsigned T1GR3              : 1;
    unsigned T1CKIR0            : 1;
    unsigned T1CKIR1            : 1;
    unsigned T1CKIR2            : 1;
    unsigned T1CKIR3            : 1;
    };

  struct
    {
    unsigned T1GR               : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T1CKIR             : 4;
    };
  } __RPINR40_41bits_t;

extern __at(0x0E3E) volatile __RPINR40_41bits_t RPINR40_41bits;

#define _T1GR0                  0x01
#define _T1GR1                  0x02
#define _T1GR2                  0x04
#define _T1GR3                  0x08
#define _T1CKIR0                0x10
#define _T1CKIR1                0x20
#define _T1CKIR2                0x40
#define _T1CKIR3                0x80

//==============================================================================


//==============================================================================
//        RPINR42_43 Bits

extern __at(0x0E3F) __sfr RPINR42_43;

typedef union
  {
  struct
    {
    unsigned T3GR0              : 1;
    unsigned T3GR1              : 1;
    unsigned T3GR2              : 1;
    unsigned T3GR3              : 1;
    unsigned T3CKIR0            : 1;
    unsigned T3CKIR1            : 1;
    unsigned T3CKIR2            : 1;
    unsigned T3CKIR3            : 1;
    };

  struct
    {
    unsigned T3GR               : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T3CKIR             : 4;
    };
  } __RPINR42_43bits_t;

extern __at(0x0E3F) volatile __RPINR42_43bits_t RPINR42_43bits;

#define _T3GR0                  0x01
#define _T3GR1                  0x02
#define _T3GR2                  0x04
#define _T3GR3                  0x08
#define _T3CKIR0                0x10
#define _T3CKIR1                0x20
#define _T3CKIR2                0x40
#define _T3CKIR3                0x80

//==============================================================================


//==============================================================================
//        RPINR44_45 Bits

extern __at(0x0E40) __sfr RPINR44_45;

typedef union
  {
  struct
    {
    unsigned T5GR0              : 1;
    unsigned T5GR1              : 1;
    unsigned T5GR2              : 1;
    unsigned T5GR3              : 1;
    unsigned T5CKIR0            : 1;
    unsigned T5CKIR1            : 1;
    unsigned T5CKIR2            : 1;
    unsigned T5CKIR3            : 1;
    };

  struct
    {
    unsigned T5GR               : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T5CKIR             : 4;
    };
  } __RPINR44_45bits_t;

extern __at(0x0E40) volatile __RPINR44_45bits_t RPINR44_45bits;

#define _T5GR0                  0x01
#define _T5GR1                  0x02
#define _T5GR2                  0x04
#define _T5GR3                  0x08
#define _T5CKIR0                0x10
#define _T5CKIR1                0x20
#define _T5CKIR2                0x40
#define _T5CKIR3                0x80

//==============================================================================


//==============================================================================
//        RPINR46_47 Bits

extern __at(0x0E41) __sfr RPINR46_47;

typedef union
  {
  struct
    {
    unsigned PBIO0R0            : 1;
    unsigned PBIO0R1            : 1;
    unsigned PBIO0R2            : 1;
    unsigned PBIO0R3            : 1;
    unsigned PBIO1R0            : 1;
    unsigned PBIO1R1            : 1;
    unsigned PBIO1R2            : 1;
    unsigned PBIO1R3            : 1;
    };

  struct
    {
    unsigned PBIO0R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PBIO1R             : 4;
    };
  } __RPINR46_47bits_t;

