OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f85j94.h
extern __at(0x0ED9) volatile __LCDCONbits_t LCDCONbits;

#define _LMUX0                  0x01
#define _LMUX1                  0x02
#define _LMUX2                  0x04
#define _CS0                    0x08
#define _CS1                    0x10
#define _WERR                   0x20
#define _SLPEN                  0x40
#define _LCDEN                  0x80

//==============================================================================


//==============================================================================
//        LCDPS Bits

extern __at(0x0EDA) __sfr LCDPS;

typedef union
  {
  struct
    {
    unsigned LP0                : 1;
    unsigned LP1                : 1;
    unsigned LP2                : 1;
    unsigned LP3                : 1;
    unsigned WA                 : 1;
    unsigned LCDA               : 1;
    unsigned BIASMD             : 1;
    unsigned WFT                : 1;
    };

  struct
    {
    unsigned LP                 : 4;
    unsigned                    : 4;
    };
  } __LCDPSbits_t;

extern __at(0x0EDA) volatile __LCDPSbits_t LCDPSbits;

#define _LP0                    0x01
#define _LP1                    0x02
#define _LP2                    0x04
#define _LP3                    0x08
#define _WA                     0x10
#define _LCDA                   0x20
#define _BIASMD                 0x40
#define _WFT                    0x80

//==============================================================================


//==============================================================================
//        REFO2CON3 Bits

extern __at(0x0EDB) __sfr REFO2CON3;

typedef struct
  {
  unsigned RODIV8               : 1;
  unsigned RODIV9               : 1;
  unsigned RODIV10              : 1;
  unsigned RODIV11              : 1;
  unsigned RODIV12              : 1;
  unsigned RODIV13              : 1;
  unsigned RODIV14              : 1;
  unsigned                      : 1;
  } __REFO2CON3bits_t;

extern __at(0x0EDB) volatile __REFO2CON3bits_t REFO2CON3bits;

#define _REFO2CON3_RODIV8       0x01
#define _REFO2CON3_RODIV9       0x02
#define _REFO2CON3_RODIV10      0x04
#define _REFO2CON3_RODIV11      0x08
#define _REFO2CON3_RODIV12      0x10
#define _REFO2CON3_RODIV13      0x20
#define _REFO2CON3_RODIV14      0x40

//==============================================================================


//==============================================================================
//        REFO2CON2 Bits

extern __at(0x0EDC) __sfr REFO2CON2;

typedef struct
  {
  unsigned RODIV0               : 1;
  unsigned RODIV1               : 1;
  unsigned RODIV2               : 1;
  unsigned RODIV3               : 1;
  unsigned RODIV4               : 1;
  unsigned RODIV5               : 1;
  unsigned RODIV6               : 1;
  unsigned RODIV7               : 1;
  } __REFO2CON2bits_t;

extern __at(0x0EDC) volatile __REFO2CON2bits_t REFO2CON2bits;

#define _REFO2CON2_RODIV0       0x01
#define _REFO2CON2_RODIV1       0x02
#define _REFO2CON2_RODIV2       0x04
#define _REFO2CON2_RODIV3       0x08
#define _REFO2CON2_RODIV4       0x10
#define _REFO2CON2_RODIV5       0x20
#define _REFO2CON2_RODIV6       0x40
#define _REFO2CON2_RODIV7       0x80

//==============================================================================


//==============================================================================
//        REFO2CON1 Bits

extern __at(0x0EDD) __sfr REFO2CON1;

typedef union
  {
  struct
    {
    unsigned ROSEL0             : 1;
    unsigned ROSEL1             : 1;
    unsigned ROSEL2             : 1;
    unsigned ROSEL3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ROSEL              : 4;
    unsigned                    : 4;
    };
  } __REFO2CON1bits_t;

extern __at(0x0EDD) volatile __REFO2CON1bits_t REFO2CON1bits;

#define _REFO2CON1_ROSEL0       0x01
#define _REFO2CON1_ROSEL1       0x02
#define _REFO2CON1_ROSEL2       0x04
#define _REFO2CON1_ROSEL3       0x08

//==============================================================================


//==============================================================================
//        REFO2CON Bits

extern __at(0x0EDE) __sfr REFO2CON;

typedef struct
  {
  unsigned ACTIVE               : 1;
  unsigned DIVSWEN              : 1;
  unsigned                      : 1;
  unsigned ROSSLP               : 1;
  unsigned ROOE                 : 1;
  unsigned ROSIDL               : 1;
  unsigned                      : 1;
  unsigned ROON                 : 1;
  } __REFO2CONbits_t;

extern __at(0x0EDE) volatile __REFO2CONbits_t REFO2CONbits;

#define _REFO2CON_ACTIVE        0x01
#define _REFO2CON_DIVSWEN       0x02
#define _REFO2CON_ROSSLP        0x08
#define _REFO2CON_ROOE          0x10
#define _REFO2CON_ROSIDL        0x20
#define _REFO2CON_ROON          0x80

//==============================================================================


//==============================================================================
//        REFO1CON3 Bits

extern __at(0x0EDF) __sfr REFO1CON3;

typedef struct
  {
  unsigned RODIV8               : 1;
  unsigned RODIV9               : 1;
  unsigned RODIV10              : 1;
  unsigned RODIV11              : 1;
  unsigned RODIV12              : 1;
  unsigned RODIV13              : 1;
  unsigned RODIV14              : 1;
  unsigned                      : 1;
  } __REFO1CON3bits_t;

extern __at(0x0EDF) volatile __REFO1CON3bits_t REFO1CON3bits;

#define _RODIV8                 0x01
#define _RODIV9                 0x02
#define _RODIV10                0x04
#define _RODIV11                0x08
#define _RODIV12                0x10
#define _RODIV13                0x20
#define _RODIV14                0x40

//==============================================================================


//==============================================================================
//        REFO1CON2 Bits

extern __at(0x0EE0) __sfr REFO1CON2;

typedef struct
  {
  unsigned RODIV0               : 1;
  unsigned RODIV1               : 1;
  unsigned RODIV2               : 1;
  unsigned RODIV3               : 1;
  unsigned RODIV4               : 1;
  unsigned RODIV5               : 1;
  unsigned RODIV6               : 1;
  unsigned RODIV7               : 1;
  } __REFO1CON2bits_t;

