OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f85j94.h
extern __at(0x0EF0) __sfr PMD4;

typedef struct
  {
  unsigned EMBMD                : 1;
  unsigned                      : 1;
  unsigned LVDMD                : 1;
  unsigned IOCMD                : 1;
  unsigned USBMD                : 1;
  unsigned CMP3MD               : 1;
  unsigned CMP2MD               : 1;
  unsigned CMP1MD               : 1;
  } __PMD4bits_t;

extern __at(0x0EF0) volatile __PMD4bits_t PMD4bits;

#define _EMBMD                  0x01
#define _LVDMD                  0x04
#define _IOCMD                  0x08
#define _USBMD                  0x10
#define _CMP3MD                 0x20
#define _CMP2MD                 0x40
#define _CMP1MD                 0x80

//==============================================================================


//==============================================================================
//        PMD3 Bits

extern __at(0x0EF1) __sfr PMD3;

typedef union
  {
  struct
    {
    unsigned REFO2MD            : 1;
    unsigned REFO1MD            : 1;
    unsigned PSPMD              : 1;
    unsigned LCDMD              : 1;
    unsigned RTCCMD             : 1;
    unsigned ADCMD              : 1;
    unsigned CTMUMD             : 1;
    unsigned MODMD              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned TXMMD              : 1;
    };
  } __PMD3bits_t;

extern __at(0x0EF1) volatile __PMD3bits_t PMD3bits;

#define _REFO2MD                0x01
#define _REFO1MD                0x02
#define _PSPMD                  0x04
#define _LCDMD                  0x08
#define _RTCCMD                 0x10
#define _ADCMD                  0x20
#define _CTMUMD                 0x40
#define _MODMD                  0x80
#define _TXMMD                  0x80

//==============================================================================


//==============================================================================
//        PMD2 Bits

extern __at(0x0EF2) __sfr PMD2;

typedef struct
  {
  unsigned TMR0MD               : 1;
  unsigned TMR1MD               : 1;
  unsigned TMR2MD               : 1;
  unsigned TMR3MD               : 1;
  unsigned TMR4MD               : 1;
  unsigned TMR5MD               : 1;
  unsigned TMR6MD               : 1;
  unsigned TMR8MD               : 1;
  } __PMD2bits_t;

extern __at(0x0EF2) volatile __PMD2bits_t PMD2bits;

#define _TMR0MD                 0x01
#define _TMR1MD                 0x02
#define _TMR2MD                 0x04
#define _TMR3MD                 0x08
#define _TMR4MD                 0x10
#define _TMR5MD                 0x20
#define _TMR6MD                 0x40
#define _TMR8MD                 0x80

//==============================================================================


//==============================================================================
//        PMD1 Bits

extern __at(0x0EF3) __sfr PMD1;

typedef struct
  {
  unsigned SSP1MD               : 1;
  unsigned SSP2MD               : 1;
  unsigned UART1MD              : 1;
  unsigned UART2MD              : 1;
  unsigned UART3MD              : 1;
  unsigned UART4MD              : 1;
  unsigned ECCP1MD              : 1;
  unsigned ECCP2MD              : 1;
  } __PMD1bits_t;

extern __at(0x0EF3) volatile __PMD1bits_t PMD1bits;

#define _SSP1MD                 0x01
#define _SSP2MD                 0x02
#define _UART1MD                0x04
#define _UART2MD                0x08
#define _UART3MD                0x10
#define _UART4MD                0x20
#define _ECCP1MD                0x40
#define _ECCP2MD                0x80

//==============================================================================


//==============================================================================
//        PMD0 Bits

extern __at(0x0EF4) __sfr PMD0;

typedef struct
  {
  unsigned ECCP3MD              : 1;
  unsigned CCP4MD               : 1;
  unsigned CCP5MD               : 1;
  unsigned CCP6MD               : 1;
  unsigned CCP7MD               : 1;
  unsigned CCP8MD               : 1;
  unsigned CCP9MD               : 1;
  unsigned CCP10MD              : 1;
  } __PMD0bits_t;

extern __at(0x0EF4) volatile __PMD0bits_t PMD0bits;

#define _ECCP3MD                0x01
#define _CCP4MD                 0x02
#define _CCP5MD                 0x04
#define _CCP6MD                 0x08
#define _CCP7MD                 0x10
#define _CCP8MD                 0x20
#define _CCP9MD                 0x40
#define _CCP10MD                0x80

//==============================================================================


//==============================================================================
//        CTMUCON4 Bits

extern __at(0x0EF5) __sfr CTMUCON4;

typedef union
  {
  struct
    {
    unsigned EDG1STAT           : 1;
    unsigned EDG2STAT           : 1;
    unsigned EDG1SEL0           : 1;
    unsigned EDG1SEL1           : 1;
    unsigned EDG1SEL2           : 1;
    unsigned EDG1SEL3           : 1;
    unsigned EDG1POL            : 1;
    unsigned EDG1EN             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned EDG1SEL            : 4;
    unsigned                    : 2;
    };
  } __CTMUCON4bits_t;

extern __at(0x0EF5) volatile __CTMUCON4bits_t CTMUCON4bits;

#define _EDG1STAT               0x01
#define _EDG2STAT               0x02
#define _EDG1SEL0               0x04
#define _EDG1SEL1               0x08
#define _EDG1SEL2               0x10
#define _EDG1SEL3               0x20
#define _EDG1POL                0x40
#define _EDG1EN                 0x80

//==============================================================================


//==============================================================================
//        CTMUCON3 Bits

extern __at(0x0EF6) __sfr CTMUCON3;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned EDG2SEL0           : 1;
    unsigned EDG2SEL1           : 1;
    unsigned EDG2SEL2           : 1;
    unsigned EDG2SEL3           : 1;
    unsigned EDG2POL            : 1;
    unsigned EDG2EN             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned EDG2SEL            : 4;
    unsigned                    : 2;
    };
  } __CTMUCON3bits_t;

extern __at(0x0EF6) volatile __CTMUCON3bits_t CTMUCON3bits;

